/*****************************************************************************
 * Copyright (c) 2017 Horizon Robotics. All rights reserved.
 * Created by chen.tang@horizon.ai
 * Data : 2018/12/28
 *****************************************************************************/

#ifndef _HOBOT_SPEECH_API_H_
#define _HOBOT_SPEECH_API_H_

#include "hobotdefine.h"

namespace hobot {

namespace speech {

/****************************************************************************
 * info   : 语音SDK初始化，内部资源初始化，全局调用一次
 * param  : device：接入设备号，默认为” hw:1,0”
 * return : 0 : 初始化成功   -1 ：初始化失败
 ***************************************************************************/
int Init(const char *device);

/****************************************************************************
 * info   : 设置语音获取回调接口，需要在start前调用
 * param  : fun : 注册的回调函数
 * return : 0 : 初始化成功   -1 ：初始化失败
 ***************************************************************************/
int SetAudioCallback(hobot_audio_data_callback fun);

/****************************************************************************
 * info   : 语音SDK启动
 * param  : 无
 * return : 0 : 初始化成功   -1 ：初始化失败
 ***************************************************************************/
int Start();

/****************************************************************************
 * info   : 语音SDK结束，结束之后不再有音频数据
 * param  : 无
 * return : 无
 ***************************************************************************/
void Finish();

/****************************************************************************
 * info   : 语音SDK去初始化，内部资源释放，全局调用一次
 * param  : 无
 * return : 无
 ***************************************************************************/
void Finalize();

}  // end namespace speech

}  // end namespace hobot

#endif
